Tekla Open API Reference for Tekla Structures 2025
IAxisAlignedBoundingBox.GetAxisAlignedBoundingBox Method
 Gets the bounding box for the current object in the global axis coordinate system.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
RectangleBoundingBox GetAxisAlignedBoundingBox()
Function GetAxisAlignedBoundingBox As RectangleBoundingBox
Return Value
Type: RectangleBoundingBox
A rectangle bounding box for the current object.
See Also
Reference
IAxisAlignedBoundingBox Interface
Tekla.Structures.Drawing Namespace